Update docs and web UI for mammoth
